
# tap repositories and their packages

tap 'homebrew/core'
brew 'ack'
brew 'bat'
brew 'cask'
brew 'chezmoi'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'dateutils'
brew 'docker-compose'
brew 'exa'
brew 'ffmpeg'
brew 'findutils'
brew 'fzf'
brew 'gcc'
brew 'ghq'
brew 'gibo'
brew 'git'
brew 'grep'
brew 'gtk+'
brew 'gtk+3'
brew 'gtk-mac-integration'
brew 'highlight'
brew 'jq'
brew 'lazygit'
brew 'lua'
brew 'luajit', args: ['HEAD']
brew 'mas'
brew 'neovim'
brew 'node'
brew 'nvm'
brew 'openjdk'
brew 'openssl@1.1'
brew 'qpdf'
brew 'qt'
brew 'qt@5'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'rsync'
brew 'texlab'
brew 'texlive'
brew 'tmux'
brew 'tmuxinator'
brew 'trash'
brew 'tree-sitter'
brew 'tty-clock'
brew 'typescript'
brew 'yarn'
brew 'ydiff'
brew 'zplug'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono-nerd-font'

tap 'homebrew/cask-versions'

tap 'homebrew/services'

tap 'homebrew/cask'
cask '1password'
cask 'alacritty'
cask 'caffeine'
cask 'docker'
cask 'inkscape'
cask 'mactex'
cask 'miniconda'
cask 'vlc'
cask 'zoom'
cask 'zotero'

tap 'rcmdnk/file'
brew 'brew-file'


